
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>加密算法 · Ariescat's Note</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="Ariescat">
        
        
    
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search-pro/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-code/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-lightbox/css/lightbox.min.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-tbfed-pagefooter/footer.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-expandable-chapters/expandable-chapters.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-theme-lou/lou.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

    
    <link rel="stylesheet" type="text/css" href="../css/custom.css" />
    
    <link rel="stylesheet" type="text/css" href="../css/auto-numbering.css" />
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="鉴权接口.html" />
    
    
    <link rel="prev" href="../Note_Plus/资料收藏.html" />
    

    </head>
    <body>
         

<div class="book">
  <div class="header-inner">
    <!-- LOGO -->
    <div class="logo"></div>
    <span class="title"></span>

    <!-- Search -->
    
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>


    <!-- Nav -->
    <ul class="header-nav">
      <li>
        <a href="https://home.ariescat.top/" target="_blank">Home</a>
      </li><li>
        <a href="https://ariescat.top/" target="_blank">Blog</a>
      </li><li>
        <a href="https://github.com/ariescat/" target="_blank">Github</a>
      </li>
    </ul>
  </div>

  <div class="book-summary">
    <div class="book-summary-title">文档目录</div>
     
    <nav role="navigation">


<ul class="summary">
    
    

    

    
        
        <li class="header">介绍</li>
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                        <b>1.1.</b>
                    
                    README
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">笔记 基础</li>
        
        
    
        <li class="chapter " data-level="2.1" data-path="../Note_Base/C++.html">
            
                <a href="../Note_Base/C++.html">
            
                    
                        <b>2.1.</b>
                    
                    C++
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.2" data-path="../Note_Base/Java.html">
            
                <a href="../Note_Base/Java.html">
            
                    
                        <b>2.2.</b>
                    
                    Java
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.3" data-path="../Note_Base/Python.html">
            
                <a href="../Note_Base/Python.html">
            
                    
                        <b>2.3.</b>
                    
                    Python
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.4" data-path="../Note_Base/前端技术.html">
            
                <a href="../Note_Base/前端技术.html">
            
                    
                        <b>2.4.</b>
                    
                    前端（Web）
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.5" data-path="../Note_Base/后端技术.html">
            
                <a href="../Note_Base/后端技术.html">
            
                    
                        <b>2.5.</b>
                    
                    后端（服务器）
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.6" data-path="../Note_Base/操作系统.html">
            
                <a href="../Note_Base/操作系统.html">
            
                    
                        <b>2.6.</b>
                    
                    操作系统
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.7" data-path="../Note_Base/数据库.html">
            
                <a href="../Note_Base/数据库.html">
            
                    
                        <b>2.7.</b>
                    
                    数据库
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.8" data-path="../Note_Base/网络.html">
            
                <a href="../Note_Base/网络.html">
            
                    
                        <b>2.8.</b>
                    
                    网络
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">笔记 算法</li>
        
        
    
        <li class="chapter " data-level="3.1" data-path="../Note_Base/数据结构与算法.html">
            
                <a href="../Note_Base/数据结构与算法.html">
            
                    
                        <b>3.1.</b>
                    
                    数据结构与算法
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">笔记 Plus</li>
        
        
    
        <li class="chapter " data-level="4.1" data-path="../Note_Plus/游戏服务端.html">
            
                <a href="../Note_Plus/游戏服务端.html">
            
                    
                        <b>4.1.</b>
                    
                    游戏服务端
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.2" data-path="../Note_Plus/图形学.html">
            
                <a href="../Note_Plus/图形学.html">
            
                    
                        <b>4.2.</b>
                    
                    图形学
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.3" data-path="../Note_Plus/数学.html">
            
                <a href="../Note_Plus/数学.html">
            
                    
                        <b>4.3.</b>
                    
                    数学
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.4" data-path="../Note_Plus/人工智障.html">
            
                <a href="../Note_Plus/人工智障.html">
            
                    
                        <b>4.4.</b>
                    
                    人工智障
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.5" data-path="../Note_Plus/资料收藏.html">
            
                <a href="../Note_Plus/资料收藏.html">
            
                    
                        <b>4.5.</b>
                    
                    资料收藏
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">笔记 摘录</li>
        
        
    
        <li class="chapter active" data-level="5.1" data-path="加密算法.html">
            
                <a href="加密算法.html">
            
                    
                        <b>5.1.</b>
                    
                    加密算法
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="5.2" data-path="鉴权接口.html">
            
                <a href="鉴权接口.html">
            
                    
                        <b>5.2.</b>
                    
                    鉴权接口
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">笔记 零散</li>
        
        
    
        <li class="chapter " data-level="6.1" data-path="../Note_Recording/零散记录.html">
            
                <a href="../Note_Recording/零散记录.html">
            
                    
                        <b>6.1.</b>
                    
                    零散记录
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">笔记 阅读</li>
        
        
    
        <li class="chapter " data-level="7.1" data-path="../Note_Reading/公众号.html">
            
                <a href="../Note_Reading/公众号.html">
            
                    
                        <b>7.1.</b>
                    
                    公众号.md
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="7.2" data-path="../Note_Reading/《Effective Java》.html">
            
                <a href="../Note_Reading/《Effective Java》.html">
            
                    
                        <b>7.2.</b>
                    
                    《Effective Java》
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="7.3" data-path="../Note_Reading/《设计模式之美》.html">
            
                <a href="../Note_Reading/《设计模式之美》.html">
            
                    
                        <b>7.3.</b>
                    
                    《设计模式之美》
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>

</nav>
     
  </div>

  <!-- Content nav -->
  <div class="book-anchor">
    <div class="book-anchor-title"></div>

    <div class="book-anchor-body"></div>
  </div>

  <div class="book-body">
    
    <div class="body-inner">
       

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >加密算法</a>
    </h1>
</div>



      <div class="page-wrapper" tabindex="-1" role="main">
        <div class="page-inner">
          
<div id="book-search-results">
    <div class="search-noresults">
    
          <section class="normal markdown-section">
             <h1 id="&#x52A0;&#x5BC6;&#x7B97;&#x6CD5;">&#x52A0;&#x5BC6;&#x7B97;&#x6CD5;</h1>
<p>&#x8BF4;&#x5230;&#x5BC6;&#x7801;&#xFF0C;&#x6211;&#x4EEC;&#x7B2C;&#x4E00;&#x4E2A;&#x60F3;&#x5230;&#x7684;&#x5C31;&#x662F;&#x767B;&#x9646;&#x8D26;&#x6237;&#x7684;&#x5BC6;&#x7801;&#xFF0C;&#x4F46;&#x662F;&#x4ECE;&#x5BC6;&#x7801;&#x5B66;&#x7684;&#x89D2;&#x5EA6;&#x6765;&#x770B;&#xFF0C;&#x8FD9;&#x79CD;&#x6839;&#x672C;&#x5C31;&#x4E0D;&#x7B97;&#x5408;&#x683C;&#x7684;&#x5BC6;&#x7801;&#x3002;</p>
<p>&#x4E3A;&#x4EC0;&#x4E48;&#x5462;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x7684;&#x8D26;&#x6237;&#x5BC6;&#x7801;&#xFF0C;&#x662F;&#x4F9D;&#x9760;&#x9690;&#x853D;&#x6027;&#x6765;&#x8FBE;&#x5230;&#x52A0;&#x5BC6;&#x4F5C;&#x7528;&#xFF1A;&#x5BC6;&#x7801;&#x85CF;&#x5728;&#x6211;&#x5FC3;&#x91CC;&#xFF0C;&#x4F60;&#x4E0D;&#x77E5;&#x9053;&#xFF0C;&#x6240;&#x4EE5;&#x4F60;&#x767B;&#x4E0D;&#x4E0A;&#x6211;&#x7684;&#x8D26;&#x6237;&#x3002;</p>
<p>&#x7136;&#x800C;&#x5BC6;&#x7801;&#x6280;&#x672F;&#x8BA4;&#x4E3A;&#xFF0C;&#x300C;&#x4FDD;&#x5BC6;&#x300D;&#x4FE1;&#x606F;&#x603B;&#x6709;&#x4E00;&#x5929;&#x4F1A;&#x88AB;&#x6252;&#x51FA;&#x6765;&#xFF0C;&#x6240;&#x4EE5;&#x52A0;&#x5BC6;&#x7B97;&#x6CD5;&#x4E0D;&#x5E94;&#x8BE5;&#x4F9D;&#x9760;&#x300C;&#x4FDD;&#x5BC6;&#x300D;&#x6765;&#x4FDD;&#x8BC1;&#x673A;&#x5BC6;&#x6027;&#xFF0C;&#x800C;&#x5E94;&#x8BE5;&#x505A;&#x5230;&#xFF1A;&#x5373;&#x4FBF;&#x77E5;&#x9053;&#x4E86;&#x52A0;&#x5BC6;&#x7B97;&#x6CD5;&#xFF0C;&#x4F9D;&#x7136;&#x65E0;&#x8BA1;&#x53EF;&#x65BD;&#x3002;&#x8BF4;&#x7684;&#x9B54;&#x5E7B;&#x4E00;&#x70B9;&#x5C31;&#x662F;&#xFF0C;&#x544A;&#x8BC9;&#x4F60;&#x6211;&#x7684;&#x5BC6;&#x7801;&#xFF0C;&#x4F60;&#x4F9D;&#x7136;&#x4E0D;&#x77E5;&#x9053;&#x6211;&#x7684;&#x5BC6;&#x7801;&#x3002;</p>
<p>&#x6700;&#x7384;&#x5B66;&#x7684;&#x5C31;&#x662F; Diffie-Hellman &#x5BC6;&#x94A5;&#x4EA4;&#x6362;&#x7B97;&#x6CD5;&#xFF0C;&#x6211;&#x5F53;&#x521D;&#x5C31;&#x89C9;&#x5F97;&#x5F88;&#x60CA;&#x5947;&#xFF0C;&#x4E24;&#x4E2A;&#x4EBA;&#x5F53;&#x7740;&#x4F60;&#x7684;&#x9762;&#x4E92;&#x76F8;&#x62A5;&#x51E0;&#x4E2A;&#x6570;&#x5B57;&#xFF0C;&#x4ED6;&#x4EEC;&#x5C31;&#x53EF;&#x4EE5;&#x62E5;&#x6709;&#x4E00;&#x4E2A;&#x5171;&#x540C;&#x7684;&#x79D8;&#x5BC6;&#xFF0C;&#x800C;&#x4F60;&#x5374;&#x6839;&#x672C;&#x4E0D;&#x53EF;&#x80FD;&#x7B97;&#x51FA;&#x6765;&#x8FD9;&#x4E2A;&#x79D8;&#x5BC6;&#x3002;&#x4E0B;&#x6587;&#x4F1A;&#x7740;&#x91CD;&#x4ECB;&#x7ECD;&#x4E00;&#x4E0B;&#x8FD9;&#x4E2A;&#x7B97;&#x6CD5;&#x3002;</p>
<p>&#x672C;&#x6587;&#x8BA8;&#x8BBA;&#x7684;&#x5BC6;&#x7801;&#x6280;&#x672F;&#x8981;&#x89E3;&#x51B3;&#x7684;&#x4E3B;&#x8981;&#x662F;&#x4FE1;&#x606F;&#x4F20;&#x8F93;&#x4E2D;&#x7684;&#x52A0;&#x5BC6;&#x548C;&#x89E3;&#x5BC6;&#x95EE;&#x9898;&#x3002;&#x8981;&#x5047;&#x8BBE;&#x6570;&#x636E;&#x4F20;&#x8F93;&#x8FC7;&#x7A0B;&#x662F;&#x4E0D;&#x5B89;&#x5168;&#x7684;&#xFF0C;&#x6240;&#x6709;&#x4FE1;&#x606F;&#x90FD;&#x5728;&#x88AB;&#x7A83;&#x542C;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x53D1;&#x9001;&#x7AEF;&#x8981;&#x628A;&#x4FE1;&#x606F;&#x52A0;&#x5BC6;&#xFF0C;&#x63A5;&#x6536;&#x65B9;&#x6536;&#x5230;&#x4FE1;&#x606F;&#x4E4B;&#x540E;&#xFF0C;&#x80AF;&#x5B9A;&#x5F97;&#x77E5;&#x9053;&#x5982;&#x4F55;&#x89E3;&#x5BC6;&#x3002;&#x6709;&#x610F;&#x601D;&#x7684;&#x662F;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x80FD;&#x591F;&#x8BA9;&#x63A5;&#x6536;&#x8005;&#x77E5;&#x9053;&#x5982;&#x4F55;&#x89E3;&#x5BC6;&#xFF0C;&#x90A3;&#x4E48;&#x7A83;&#x542C;&#x8005;&#x4E0D;&#x662F;&#x4E5F;&#x80FD;&#x591F;&#x77E5;&#x9053;&#x5982;&#x4F55;&#x89E3;&#x5BC6;&#x4E86;&#x5417;&#xFF1F;</p>
<p>&#x4E0B;&#x9762;&#xFF0C;<strong>&#x6211;&#x4EEC;&#x4F1A;&#x4ECB;&#x7ECD;&#x5BF9;&#x79F0;&#x52A0;&#x5BC6;&#x7B97;&#x6CD5;&#x3001;&#x5BC6;&#x94A5;&#x4EA4;&#x6362;&#x7B97;&#x6CD5;&#x3001;&#x975E;&#x5BF9;&#x79F0;&#x52A0;&#x5BC6;&#x7B97;&#x6CD5;&#x3001;&#x6570;&#x5B57;&#x7B7E;&#x540D;&#x3001;&#x516C;&#x94A5;&#x8BC1;&#x4E66;</strong>&#xFF0C;&#x770B;&#x770B;&#x89E3;&#x51B3;&#x5B89;&#x5168;&#x4F20;&#x8F93;&#x95EE;&#x9898;&#x7684;&#x4E00;&#x8DEF;&#x574E;&#x5777;&#x6CE2;&#x6298;&#x3002;</p>
<h2 id="&#x4E00;&#x3001;&#x5BF9;&#x79F0;&#x6027;&#x52A0;&#x5BC6;">&#x4E00;&#x3001;&#x5BF9;&#x79F0;&#x6027;&#x52A0;&#x5BC6;</h2>
<p>&#x5BF9;&#x79F0;&#x6027;&#x5BC6;&#x7801;&#xFF0C;&#x4E5F;&#x53EB;&#x5171;&#x4EAB;&#x5BC6;&#x94A5;&#x5BC6;&#x7801;&#xFF0C;&#x987E;&#x540D;&#x601D;&#x4E49;&#xFF0C;&#x8FD9;&#x79CD;&#x52A0;&#x5BC6;&#x65B9;&#x5F0F;&#x7528;&#x76F8;&#x540C;&#x7684;&#x5BC6;&#x94A5;&#x8FDB;&#x884C;&#x52A0;&#x5BC6;&#x548C;&#x89E3;&#x5BC6;&#x3002;</p>
<p>&#x6BD4;&#x5982;&#x6211;&#x8BF4;&#x4E00;&#x79CD;&#x6700;&#x7B80;&#x5355;&#x7684;&#x5BF9;&#x79F0;&#x52A0;&#x5BC6;&#x7684;&#x65B9;&#x6CD5;&#x3002;&#x9996;&#x5148;&#x6211;&#x4EEC;&#x77E5;&#x9053;&#x4FE1;&#x606F;&#x90FD;&#x53EF;&#x4EE5;&#x8868;&#x793A;&#x6210; 0/1 &#x6BD4;&#x7279;&#x5E8F;&#x5217;&#xFF0C;&#x4E5F;&#x77E5;&#x9053;&#x76F8;&#x540C;&#x7684;&#x4E24;&#x4E2A;&#x6BD4;&#x7279;&#x5E8F;&#x5217;&#x505A;&#x5F02;&#x6216;&#x8FD0;&#x7B97;&#x7684;&#x7ED3;&#x679C;&#x4E3A; 0&#x3002;</p>
<p>&#x90A3;&#x4E48;&#x6211;&#x4EEC;&#x5C31;&#x53EF;&#x4EE5;&#x751F;&#x6210;&#x4E00;&#x4E2A;&#x957F;&#x5EA6;&#x548C;&#x539F;&#x59CB;&#x4FE1;&#x606F;&#x4E00;&#x6837;&#x7684;&#x968F;&#x673A;&#x6BD4;&#x7279;&#x5E8F;&#x5217;&#x4F5C;&#x4E3A;&#x5BC6;&#x94A5;&#xFF0C;&#x7136;&#x540E;&#x7528;&#x5B83;&#x5BF9;&#x539F;&#x59CB;&#x4FE1;&#x606F;&#x505A;&#x5F02;&#x6216;&#x8FD0;&#x7B97;&#xFF0C;&#x5C31;&#x751F;&#x6210;&#x4E86;&#x5BC6;&#x6587;&#x3002;&#x53CD;&#x4E4B;&#xFF0C;&#x518D;&#x7528;&#x8BE5;&#x5BC6;&#x94A5;&#x5BF9;&#x5BC6;&#x6587;&#x505A;&#x4E00;&#x6B21;&#x5F02;&#x6216;&#x8FD0;&#x7B97;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x6062;&#x590D;&#x539F;&#x59CB;&#x4FE1;&#x606F;&#x3002;</p>
<p>&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x4F8B;&#x5B50;&#xFF0C;&#x4E0D;&#x8FC7;&#x6709;&#x4E9B;&#x8FC7;&#x4E8E;&#x7B80;&#x5355;&#xFF0C;&#x6709;&#x5F88;&#x591A;&#x95EE;&#x9898;&#x3002;&#x6BD4;&#x5982;&#x5BC6;&#x94A5;&#x7684;&#x957F;&#x5EA6;&#x548C;&#x539F;&#x59CB;&#x4FE1;&#x606F;&#x5B8C;&#x5168;&#x4E00;&#x81F4;&#xFF0C;&#x5982;&#x679C;&#x539F;&#x59CB;&#x4FE1;&#x606F;&#x5F88;&#x5927;&#xFF0C;&#x5BC6;&#x94A5;&#x4E5F;&#x4F1A;&#x4E00;&#x6837;&#x5927;&#xFF0C;&#x800C;&#x4E14;&#x751F;&#x6210;&#x5927;&#x91CF;&#x771F;&#x968F;&#x673A;&#x6BD4;&#x7279;&#x5E8F;&#x5217;&#x7684;&#x8BA1;&#x7B97;&#x5F00;&#x9500;&#x4E5F;&#x6BD4;&#x8F83;&#x5927;&#x3002;</p>
<p>&#x5F53;&#x7136;&#xFF0C;&#x6709;&#x5F88;&#x591A;&#x66F4;&#x590D;&#x6742;&#x4F18;&#x79C0;&#x7684;&#x5BF9;&#x79F0;&#x52A0;&#x5BC6;&#x7B97;&#x6CD5;&#x89E3;&#x51B3;&#x4E86;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#xFF0C;&#x6BD4;&#x5982; Rijndael &#x7B97;&#x6CD5;&#x3001;&#x4E09;&#x91CD; DES &#x7B97;&#x6CD5;&#x7B49;&#x7B49;&#x3002;<strong>&#x5B83;&#x4EEC;&#x4ECE;&#x7B97;&#x6CD5;&#x4E0A;&#x662F;&#x65E0;&#x61C8;&#x53EF;&#x51FB;&#x7684;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x62E5;&#x6709;&#x5DE8;&#x5927;&#x7684;&#x5BC6;&#x94A5;&#x7A7A;&#x95F4;&#xFF0C;&#x57FA;&#x672C;&#x65E0;&#x6CD5;&#x66B4;&#x529B;&#x7834;&#x89E3;&#xFF0C;&#x800C;&#x4E14;&#x52A0;&#x5BC6;&#x8FC7;&#x7A0B;&#x76F8;&#x5BF9;&#x5FEB;&#x901F;</strong>&#x3002;</p>
<p><strong>&#x4F46;&#x662F;&#xFF0C;&#x4E00;&#x5207;&#x5BF9;&#x79F0;&#x52A0;&#x5BC6;&#x7B97;&#x6CD5;&#x7684;&#x8F6F;&#x808B;&#x5728;&#x4E8E;&#x5BC6;&#x94A5;&#x7684;&#x914D;&#x9001;</strong>&#x3002;&#x52A0;&#x5BC6;&#x548C;&#x89E3;&#x5BC6;&#x7528;&#x540C;&#x4E00;&#x4E2A;&#x5BC6;&#x94A5;&#xFF0C;&#x53D1;&#x9001;&#x65B9;&#x5FC5;&#x987B;&#x8BBE;&#x6CD5;&#x628A;&#x5BC6;&#x94A5;&#x53D1;&#x9001;&#x7ED9;&#x63A5;&#x6536;&#x65B9;&#x3002;&#x5982;&#x679C;&#x7A83;&#x542C;&#x8005;&#x6709;&#x80FD;&#x529B;&#x7A83;&#x53D6;&#x5BC6;&#x6587;&#xFF0C;&#x80AF;&#x5B9A;&#x4E5F;&#x53EF;&#x4EE5;&#x7A83;&#x53D6;&#x5BC6;&#x94A5;&#xFF0C;&#x90A3;&#x4E48;&#x518D;&#x65E0;&#x61C8;&#x53EF;&#x51FB;&#x7684;&#x7B97;&#x6CD5;&#x4F9D;&#x7136;&#x4E0D;&#x653B;&#x81EA;&#x7834;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#xFF0C;&#x4E0B;&#x9762;&#x4ECB;&#x7ECD;&#x4E24;&#x79CD;&#x89E3;&#x51B3;&#x5BC6;&#x94A5;&#x914D;&#x9001;&#x95EE;&#x9898;&#x6700;&#x5E38;&#x89C1;&#x7684;&#x7B97;&#x6CD5;&#xFF0C;&#x5206;&#x522B;&#x662F; Diffie-Hellman &#x5BC6;&#x94A5;&#x4EA4;&#x6362;&#x7B97;&#x6CD5;&#x548C;&#x975E;&#x5BF9;&#x79F0;&#x52A0;&#x5BC6;&#x7B97;&#x6CD5;&#x3002;</p>
<h2 id="&#x4E8C;&#x3001;&#x5BC6;&#x94A5;&#x4EA4;&#x6362;&#x7B97;&#x6CD5;">&#x4E8C;&#x3001;&#x5BC6;&#x94A5;&#x4EA4;&#x6362;&#x7B97;&#x6CD5;</h2>
<p>&#x6211;&#x4EEC;&#x6240;&#x8BF4;&#x7684;&#x5BC6;&#x94A5;&#x4E00;&#x822C;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x5F88;&#x5927;&#x7684;&#x6570;&#x5B57;&#xFF0C;&#x7B97;&#x6CD5;&#x7528;&#x8FD9;&#x4E2A;&#x6570;&#x52A0;&#x5BC6;&#x3001;&#x89E3;&#x5BC6;&#x3002;&#x95EE;&#x9898;&#x5728;&#x4E8E;&#xFF0C;&#x4FE1;&#x9053;&#x662F;&#x4E0D;&#x5B89;&#x5168;&#x7684;&#xFF0C;&#x6240;&#x6709;&#x53D1;&#x51FA;&#x7684;&#x6570;&#x636E;&#x90FD;&#x4F1A;&#x88AB;&#x7A83;&#x53D6;&#x3002;&#x6362;&#x53E5;&#x8BDD;&#x8BF4;&#xFF0C;&#x6709;&#x6CA1;&#x6709;&#x4E00;&#x79CD;&#x529E;&#x6CD5;&#xFF0C;&#x80FD;&#x591F;&#x8BA9;&#x4E24;&#x4E2A;&#x4EBA;&#x5728;&#x4F17;&#x76EE;&#x777D;&#x777D;&#x4E4B;&#x4E0B;&#xFF0C;&#x5149;&#x660E;&#x6B63;&#x5927;&#x5730;&#x4EA4;&#x6362;&#x4E00;&#x4E2A;&#x79D8;&#x5BC6;&#xFF0C;&#x628A;&#x5BF9;&#x79F0;&#x6027;&#x5BC6;&#x94A5;&#x5B89;&#x5168;&#x5730;&#x9001;&#x5230;&#x63A5;&#x6536;&#x65B9;&#x7684;&#x624B;&#x4E2D;&#xFF1F;</p>
<p>Diffie-Hellman &#x5BC6;&#x94A5;&#x4EA4;&#x6362;&#x7B97;&#x6CD5;&#x53EF;&#x4EE5;&#x505A;&#x5230;&#x3002;<strong>&#x51C6;&#x786E;&#x7684;&#x8BF4;&#xFF0C;&#x8BE5;&#x7B97;&#x6CD5;&#x5E76;&#x4E0D;&#x662F;&#x628A;&#x4E00;&#x4E2A;&#x79D8;&#x5BC6;&#x5B89;&#x5168;&#x5730;&#x300C;&#x9001;&#x7ED9;&#x300D;&#x5BF9;&#x65B9;&#xFF0C;&#x800C;&#x662F;&#x901A;&#x8FC7;&#x4E00;&#x4E9B;&#x5171;&#x4EAB;&#x7684;&#x6570;&#x5B57;&#xFF0C;&#x53CC;&#x65B9;&#x300C;&#x5FC3;&#x4E2D;&#x300D;&#x5404;&#x81EA;&#x300C;&#x751F;&#x6210;&#x300D;&#x4E86;&#x4E00;&#x4E2A;&#x76F8;&#x540C;&#x7684;&#x79D8;&#x5BC6;&#xFF0C;&#x800C;&#x4E14;&#x53CC;&#x65B9;&#x7684;&#x8FD9;&#x4E2A;&#x79D8;&#x5BC6;&#xFF0C;&#x662F;&#x7B2C;&#x4E09;&#x65B9;&#x7A83;&#x542C;&#x8005;&#x65E0;&#x6CD5;&#x751F;&#x6210;&#x7684;</strong>&#x3002;</p>
<p>&#x4E5F;&#x8BB8;&#x8FD9;&#x5C31;&#x662F;&#x4F20;&#x8BF4;&#x4E2D;&#x7684;&#x5FC3;&#x6709;&#x7075;&#x7280;&#x4E00;&#x70B9;&#x901A;&#x5427;&#x3002;</p>
<p>&#x8FD9;&#x4E2A;&#x7B97;&#x6CD5;&#x89C4;&#x5219;&#x4E0D;&#x7B97;&#x590D;&#x6742;&#xFF0C;&#x4F60;&#x751A;&#x81F3;&#x90FD;&#x53EF;&#x4EE5;&#x627E;&#x4E2A;&#x670B;&#x53CB;&#x5C1D;&#x8BD5;&#x4E00;&#x4E0B;&#x5171;&#x4EAB;&#x79D8;&#x5BC6;&#xFF0C;&#x7B49;&#x4F1A;&#x6211;&#x4F1A;&#x7B80;&#x5355;&#x753B;&#x51FA;&#x5B83;&#x7684;&#x57FA;&#x672C;&#x6D41;&#x7A0B;&#x3002;&#x5728;&#x6B64;&#x4E4B;&#x524D;&#xFF0C;&#x9700;&#x8981;&#x660E;&#x786E;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#xFF1A;<strong>&#x5E76;&#x4E0D;&#x662F;&#x6240;&#x6709;&#x8FD0;&#x7B97;&#x90FD;&#x6709;&#x9006;&#x8FD0;&#x7B97;</strong>&#x3002;</p>
<p>&#x6700;&#x7B80;&#x5355;&#x7684;&#x4F8B;&#x5B50;&#x5C31;&#x662F;&#x6211;&#x4EEC;&#x719F;&#x77E5;&#x7684;&#x5355;&#x5411;&#x6563;&#x5217;&#x51FD;&#x6570;&#xFF0C;&#x7ED9;&#x4E00;&#x4E2A;&#x6570;&#x5B57; <code>a</code> &#x548C;&#x4E00;&#x4E2A;&#x6563;&#x5217;&#x51FD;&#x6570; <code>f</code>&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5F88;&#x5FEB;&#x8BA1;&#x7B97;&#x51FA; <code>f(a)</code>&#xFF0C;&#x4F46;&#x662F;&#x5982;&#x679C;&#x7ED9;&#x4F60; <code>f(a)</code> &#x548C; <code>f</code>&#xFF0C;&#x63A8;&#x51FA; <code>a</code> &#x662F;&#x4E00;&#x4EF6;&#x57FA;&#x672C;&#x505A;&#x4E0D;&#x5230;&#x7684;&#x4E8B;&#x3002;&#x5BC6;&#x94A5;&#x4EA4;&#x6362;&#x7B97;&#x6CD5;&#x4E4B;&#x6240;&#x4EE5;&#x770B;&#x8D77;&#x6765;&#x5982;&#x6B64;&#x7384;&#x5E7B;&#xFF0C;&#x5C31;&#x662F;&#x5229;&#x7528;&#x4E86;&#x8FD9;&#x79CD;&#x4E0D;&#x53EF;&#x9006;&#x7684;&#x6027;&#x8D28;&#x3002;</p>
<p>&#x4E0B;&#x9762;&#xFF0C;&#x770B;&#x4E0B;&#x5BC6;&#x94A5;&#x4EA4;&#x6362;&#x7B97;&#x6CD5;&#x7684;&#x6D41;&#x7A0B;&#x662F;&#x4EC0;&#x4E48;&#xFF0C;&#x6309;&#x7167;&#x547D;&#x540D;&#x60EF;&#x4F8B;&#xFF0C;&#x51C6;&#x5907;&#x6267;&#x884C;&#x5BC6;&#x94A5;&#x4EA4;&#x6362;&#x7B97;&#x6CD5;&#x7684;&#x53CC;&#x65B9;&#x79F0;&#x4E3A; Alice &#x548C; Bob&#xFF0C;&#x5728;&#x7F51;&#x7EDC;&#x4E2D;&#x4F01;&#x56FE;&#x7A83;&#x53D6;&#x4ED6;&#x4FE9;&#x901A;&#x4FE1;&#x5185;&#x5BB9;&#x7684;&#x574F;&#x4EBA;&#x79F0;&#x4E3A; Hack &#x5427;&#x3002;</p>
<p>&#x9996;&#x5148;&#xFF0C;Alice &#x548C; Bob &#x534F;&#x5546;&#x51FA;&#x4E24;&#x4E2A;&#x6570;&#x5B57; <code>N</code> &#x548C; <code>G</code> &#x4F5C;&#x4E3A;&#x751F;&#x6210;&#x5143;&#xFF0C;&#x5F53;&#x7136;&#x534F;&#x5546;&#x8FC7;&#x7A0B;&#x53EF;&#x4EE5;&#x88AB;&#x7A83;&#x542C;&#x8005; Hack &#x7A83;&#x53D6;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x628A;&#x8FD9;&#x4E24;&#x4E2A;&#x6570;&#x753B;&#x5230;&#x4E2D;&#x95F4;&#xFF0C;&#x4EE3;&#x8868;&#x4E09;&#x65B9;&#x90FD;&#x77E5;&#x9053;&#xFF1A;</p>
<p><a href="../img/&#x6458;&#x6284;/labuladong/&#x52A0;&#x5BC6;&#x7B97;&#x6CD5;&#x7684;&#x524D;&#x8EAB;&#x4ECA;&#x4E16;/1.jpg" data-lightbox="250a464e-54e4-420e-9b47-26858a14c1e7" data-title="img"><img src="../img/&#x6458;&#x6284;/labuladong/&#x52A0;&#x5BC6;&#x7B97;&#x6CD5;&#x7684;&#x524D;&#x8EAB;&#x4ECA;&#x4E16;/1.jpg" alt="img"></a></p>
<p>&#x73B0;&#x5728; Alice &#x548C; Bob <strong>&#x5FC3;&#x4E2D;</strong>&#x5404;&#x81EA;&#x60F3;&#x4E00;&#x4E2A;&#x6570;&#x5B57;&#x51FA;&#x6765;&#xFF0C;&#x5206;&#x522B;&#x79F0;&#x4E3A; <code>A</code> &#x548C; <code>B</code> &#x5427;&#xFF1A;</p>
<p><a href="../img/&#x6458;&#x6284;/labuladong/&#x52A0;&#x5BC6;&#x7B97;&#x6CD5;&#x7684;&#x524D;&#x8EAB;&#x4ECA;&#x4E16;/2.jpg" data-lightbox="d921985c-e334-425c-8fda-53b6f52012fb" data-title="img"><img src="../img/&#x6458;&#x6284;/labuladong/&#x52A0;&#x5BC6;&#x7B97;&#x6CD5;&#x7684;&#x524D;&#x8EAB;&#x4ECA;&#x4E16;/2.jpg" alt="img"></a></p>
<p>&#x73B0;&#x5728; Alice &#x5C06;&#x81EA;&#x5DF1;&#x5FC3;&#x91CC;&#x7684;&#x8FD9;&#x4E2A;&#x6570;&#x5B57; <code>A</code> &#x548C; <code>G</code> &#x901A;&#x8FC7;&#x67D0;&#x4E9B;&#x8FD0;&#x7B97;&#x5F97;&#x51FA;&#x4E00;&#x4E2A;&#x6570; <code>AG</code>&#xFF0C;&#x7136;&#x540E;&#x53D1;&#x7ED9; Bob&#xFF1B;Bob &#x5C06;&#x81EA;&#x5DF1;&#x5FC3;&#x91CC;&#x7684;&#x6570; <code>B</code> &#x548C; <code>G</code> &#x901A;&#x8FC7;&#x76F8;&#x540C;&#x7684;&#x8FD0;&#x7B97;&#x5F97;&#x51FA;&#x4E00;&#x4E2A;&#x6570; <code>BG</code>&#xFF0C;&#x7136;&#x540E;&#x53D1;&#x7ED9; Alice&#xFF1A;</p>
<p><a href="../img/&#x6458;&#x6284;/labuladong/&#x52A0;&#x5BC6;&#x7B97;&#x6CD5;&#x7684;&#x524D;&#x8EAB;&#x4ECA;&#x4E16;/3.jpg" data-lightbox="9b3575c9-db36-4639-90d1-fcc6bf55a98d" data-title="img"><img src="../img/&#x6458;&#x6284;/labuladong/&#x52A0;&#x5BC6;&#x7B97;&#x6CD5;&#x7684;&#x524D;&#x8EAB;&#x4ECA;&#x4E16;/3.jpg" alt="img"></a></p>
<p>&#x73B0;&#x5728;&#x7684;&#x60C5;&#x51B5;&#x53D8;&#x6210;&#x8FD9;&#x6837;&#x4E86;&#xFF1A;</p>
<p><a href="../img/&#x6458;&#x6284;/labuladong/&#x52A0;&#x5BC6;&#x7B97;&#x6CD5;&#x7684;&#x524D;&#x8EAB;&#x4ECA;&#x4E16;/4.jpg" data-lightbox="0a5689a3-fc9e-4765-b681-3c435f737466" data-title="img"><img src="../img/&#x6458;&#x6284;/labuladong/&#x52A0;&#x5BC6;&#x7B97;&#x6CD5;&#x7684;&#x524D;&#x8EAB;&#x4ECA;&#x4E16;/4.jpg" alt="img"></a></p>
<p>&#x6CE8;&#x610F;&#xFF0C;&#x7C7B;&#x4F3C;&#x521A;&#x624D;&#x4E3E;&#x7684;&#x6563;&#x5217;&#x51FD;&#x6570;&#x7684;&#x4F8B;&#x5B50;&#xFF0C;&#x77E5;&#x9053; <code>AG</code> &#x548C; <code>G</code>&#xFF0C;&#x5E76;&#x4E0D;&#x80FD;&#x53CD;&#x63A8;&#x51FA; <code>A</code> &#x662F;&#x591A;&#x5C11;&#xFF0C;<code>BG</code> &#x540C;&#x7406;&#x3002;</p>
<p>&#x90A3;&#x4E48;&#xFF0C;Alice &#x53EF;&#x4EE5;&#x901A;&#x8FC7; <code>BG</code> &#x548C;&#x81EA;&#x5DF1;&#x7684; <code>A</code> &#x901A;&#x8FC7;&#x67D0;&#x4E9B;&#x8FD0;&#x7B97;&#x5F97;&#x5230;&#x4E00;&#x4E2A;&#x6570; <code>ABG</code>&#xFF0C;Bob &#x4E5F;&#x53EF;&#x4EE5;&#x901A;&#x8FC7; <code>AG</code> &#x548C;&#x81EA;&#x5DF1;&#x7684; <code>B</code> &#x901A;&#x8FC7;&#x67D0;&#x4E9B;&#x8FD0;&#x7B97;&#x5F97;&#x5230; <code>ABG</code>&#xFF0C;&#x8FD9;&#x4E2A;&#x6570;&#x5C31;&#x662F; Alice &#x548C; Bob &#x5171;&#x6709;&#x7684;&#x79D8;&#x5BC6;&#x3002;</p>
<p>&#x800C;&#x5BF9;&#x4E8E; Hack&#xFF0C;&#x53EF;&#x4EE5;&#x7A83;&#x53D6;&#x4F20;&#x8F93;&#x8FC7;&#x7A0B;&#x4E2D;&#x7684; <code>G</code>&#xFF0C;<code>AG</code>&#xFF0C;<code>BG</code>&#xFF0C;&#x4F46;&#x662F;&#x7531;&#x4E8E;&#x8BA1;&#x7B97;&#x4E0D;&#x53EF;&#x9006;&#xFF0C;&#x600E;&#x4E48;&#x90FD;&#x65E0;&#x6CD5;&#x7ED3;&#x5408;&#x51FA; <code>ABG</code> &#x8FD9;&#x4E2A;&#x6570;&#x5B57;&#x3002;</p>
<p><a href="../img/&#x6458;&#x6284;/labuladong/&#x52A0;&#x5BC6;&#x7B97;&#x6CD5;&#x7684;&#x524D;&#x8EAB;&#x4ECA;&#x4E16;/5.jpg" data-lightbox="1433b9c0-24c3-48c3-82e4-7ceec59b070d" data-title="img"><img src="../img/&#x6458;&#x6284;/labuladong/&#x52A0;&#x5BC6;&#x7B97;&#x6CD5;&#x7684;&#x524D;&#x8EAB;&#x4ECA;&#x4E16;/5.jpg" alt="img"></a></p>
<p>&#x4EE5;&#x4E0A;&#x5C31;&#x662F;&#x57FA;&#x672C;&#x6D41;&#x7A0B;&#xFF0C;&#x81F3;&#x4E8E;&#x5177;&#x4F53;&#x7684;&#x6570;&#x5B57;&#x53D6;&#x503C;&#x662F;&#x6709;&#x8BB2;&#x7A76;&#x7684;&#xFF0C;&#x8FD0;&#x7B97;&#x65B9;&#x6CD5;&#x5728;&#x767E;&#x5EA6;&#x4E0A;&#x5F88;&#x5BB9;&#x6613;&#x627E;&#x5230;&#xFF0C;&#x9650;&#x4E8E;&#x7BC7;&#x5E45;&#x6211;&#x5C31;&#x4E0D;&#x5177;&#x4F53;&#x5199;&#x4E86;&#x3002;</p>
<p>&#x8BE5;&#x7B97;&#x6CD5;&#x53EF;&#x4EE5;&#x5728;&#x7B2C;&#x4E09;&#x8005;&#x7A83;&#x542C;&#x7684;&#x524D;&#x63D0;&#x4E0B;&#xFF0C;&#x7B97;&#x51FA;&#x4E00;&#x4E2A;&#x522B;&#x4EBA;&#x65E0;&#x6CD5;&#x7B97;&#x51FA;&#x7684;&#x79D8;&#x5BC6;&#x4F5C;&#x4E3A;&#x5BF9;&#x79F0;&#x6027;&#x52A0;&#x5BC6;&#x7B97;&#x6CD5;&#x7684;&#x5BC6;&#x94A5;&#xFF0C;&#x5F00;&#x59CB;&#x5BF9;&#x79F0;&#x52A0;&#x5BC6;&#x7684;&#x901A;&#x4FE1;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;&#x8BE5;&#x7B97;&#x6CD5;&#xFF0C;Hack &#x53C8;&#x60F3;&#x5230;&#x4E00;&#x79CD;&#x7834;&#x89E3;&#x65B9;&#x6CD5;&#xFF0C;&#x4E0D;&#x662F;&#x7A83;&#x542C; Alice &#x548C; Bob &#x7684;&#x901A;&#x4FE1;&#x6570;&#x636E;&#xFF0C;&#x800C;&#x662F;&#x76F4;&#x63A5;&#x540C;&#x65F6;&#x5192;&#x5145; Alice &#x548C; Bob &#x7684;&#x8EAB;&#x4EFD;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x6211;&#x4EEC;&#x8BF4;&#x7684;&#x300C;<strong>&#x4E2D;&#x95F4;&#x4EBA;&#x653B;&#x51FB;</strong>&#x300D;&#xFF1A;</p>
<p><a href="../img/&#x6458;&#x6284;/labuladong/&#x52A0;&#x5BC6;&#x7B97;&#x6CD5;&#x7684;&#x524D;&#x8EAB;&#x4ECA;&#x4E16;/6.jpg" data-lightbox="26223e5c-5822-41c2-9cb4-d425a9ac876f" data-title="img"><img src="../img/&#x6458;&#x6284;/labuladong/&#x52A0;&#x5BC6;&#x7B97;&#x6CD5;&#x7684;&#x524D;&#x8EAB;&#x4ECA;&#x4E16;/6.jpg" alt="img"></a></p>
<p>&#x8FD9;&#x6837;&#xFF0C;&#x53CC;&#x65B9;&#x6839;&#x672C;&#x65E0;&#x6CD5;&#x5BDF;&#x89C9;&#x5728;&#x548C; Hack &#x5171;&#x4EAB;&#x79D8;&#x5BC6;&#xFF0C;&#x540E;&#x679C;&#x5C31;&#x662F; Hack &#x53EF;&#x4EE5;&#x89E3;&#x5BC6;&#x751A;&#x81F3;&#x4FEE;&#x6539;&#x6570;&#x636E;&#x3002;</p>
<p><strong>&#x53EF;&#x89C1;&#xFF0C;&#x5BC6;&#x94A5;&#x4EA4;&#x6362;&#x7B97;&#x6CD5;&#x4E5F;&#x4E0D;&#x7B97;&#x5B8C;&#x5168;&#x89E3;&#x51B3;&#x4E86;&#x5BC6;&#x94A5;&#x914D;&#x9001;&#x95EE;&#x9898;&#xFF0C;&#x7F3A;&#x9677;&#x5728;&#x4E8E;&#x65E0;&#x6CD5;&#x6838;&#x5B9E;&#x5BF9;&#x65B9;&#x8EAB;&#x4EFD;</strong>&#x3002;&#x6240;&#x4EE5;&#x5BC6;&#x94A5;&#x4EA4;&#x6362;&#x7B97;&#x6CD5;&#x4E4B;&#x524D;&#x4E00;&#x822C;&#x8981;&#x6838;&#x5B9E;&#x5BF9;&#x65B9;&#x8EAB;&#x4EFD;&#xFF0C;&#x6BD4;&#x5982;&#x4F7F;&#x7528;&#x6570;&#x5B57;&#x7B7E;&#x540D;&#x3002;</p>
<h2 id="&#x4E09;&#x3001;&#x975E;&#x5BF9;&#x79F0;&#x52A0;&#x5BC6;">&#x4E09;&#x3001;&#x975E;&#x5BF9;&#x79F0;&#x52A0;&#x5BC6;</h2>
<p>&#x975E;&#x5BF9;&#x79F0;&#x52A0;&#x5BC6;&#x7684;&#x601D;&#x8DEF;&#x5C31;&#x662F;&#xFF0C;&#x5E72;&#x8106;&#x522B;&#x5077;&#x5077;&#x6478;&#x6478;&#x4F20;&#x8F93;&#x5BC6;&#x94A5;&#x4E86;&#xFF0C;&#x6211;&#x628A;&#x52A0;&#x5BC6;&#x5BC6;&#x94A5;&#x548C;&#x89E3;&#x5BC6;&#x5BC6;&#x94A5;&#x5206;&#x5F00;&#xFF0C;&#x516C;&#x94A5;&#x7528;&#x4E8E;&#x52A0;&#x5BC6;&#xFF0C;&#x79C1;&#x94A5;&#x7528;&#x4E8E;&#x89E3;&#x5BC6;&#x3002;&#x53EA;&#x628A;&#x516C;&#x94A5;&#x4F20;&#x9001;&#x7ED9;&#x5BF9;&#x65B9;&#xFF0C;&#x7136;&#x540E;&#x5BF9;&#x65B9;&#x5F00;&#x59CB;&#x7ED9;&#x6211;&#x53D1;&#x9001;&#x52A0;&#x5BC6;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x6211;&#x7528;&#x79C1;&#x94A5;&#x5C31;&#x53EF;&#x4EE5;&#x89E3;&#x5BC6;&#x3002;&#x81F3;&#x4E8E;&#x7A83;&#x542C;&#x8005;&#xFF0C;&#x62FF;&#x5230;&#x516C;&#x94A5;&#x548C;&#x52A0;&#x5BC6;&#x6570;&#x636E;&#x4E5F;&#x6CA1;&#x7528;&#xFF0C;&#x56E0;&#x4E3A;&#x53EA;&#x6709;&#x6211;&#x624B;&#x4E0A;&#x7684;&#x79C1;&#x94A5;&#x624D;&#x80FD;&#x89E3;&#x5BC6;&#x3002;</p>
<p>&#x53EF;&#x4EE5;&#x8FD9;&#x6837;&#x60F3;&#xFF0C;<strong>&#x79C1;&#x94A5;&#x662F;&#x94A5;&#x5319;&#xFF0C;&#x800C;&#x516C;&#x94A5;&#x662F;&#x9501;&#xFF0C;&#x53EF;&#x4EE5;&#x628A;&#x9501;&#x516C;&#x5F00;&#x51FA;&#x53BB;&#xFF0C;&#x8BA9;&#x522B;&#x4EBA;&#x628A;&#x6570;&#x636E;&#x9501;&#x8D77;&#x6765;&#x53D1;&#x7ED9;&#x6211;&#xFF1B;&#x800C;&#x94A5;&#x5319;&#x4E00;&#x5B9A;&#x8981;&#x7559;&#x5728;&#x81EA;&#x5DF1;&#x624B;&#x91CC;&#xFF0C;&#x7528;&#x4E8E;&#x89E3;&#x9501;</strong>&#x3002;&#x6211;&#x4EEC;&#x5E38;&#x89C1;&#x7684; RSA &#x7B97;&#x6CD5;&#x5C31;&#x662F;&#x5178;&#x578B;&#x7684;&#x975E;&#x5BF9;&#x79F0;&#x52A0;&#x5BC6;&#x7B97;&#x6CD5;&#xFF0C;&#x5177;&#x4F53;&#x5B9E;&#x73B0;&#x6BD4;&#x8F83;&#x590D;&#x6742;&#xFF0C;&#x6211;&#x5C31;&#x4E0D;&#x5199;&#x4E86;&#xFF0C;&#x7F51;&#x4E0A;&#x5F88;&#x591A;&#x8D44;&#x6599;&#x3002;</p>
<p>&#x5728;&#x5B9E;&#x9645;&#x5E94;&#x7528;&#x4E2D;&#xFF0C;&#x975E;&#x5BF9;&#x79F0;&#x6027;&#x52A0;&#x5BC6;&#x7684;&#x8FD0;&#x7B97;&#x901F;&#x5EA6;&#x8981;&#x6BD4;&#x5BF9;&#x79F0;&#x6027;&#x52A0;&#x5BC6;&#x6162;&#x5F88;&#x591A;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x4F20;&#x8F93;&#x5927;&#x91CF;&#x6570;&#x636E;&#x65F6;&#xFF0C;&#x4E00;&#x822C;&#x4E0D;&#x4F1A;&#x7528;&#x516C;&#x94A5;&#x76F4;&#x63A5;&#x52A0;&#x5BC6;&#x6570;&#x636E;&#xFF0C;&#x800C;&#x662F;&#x52A0;&#x5BC6;&#x5BF9;&#x79F0;&#x6027;&#x52A0;&#x5BC6;&#x7684;&#x5BC6;&#x94A5;&#xFF0C;&#x4F20;&#x8F93;&#x7ED9;&#x5BF9;&#x65B9;&#xFF0C;&#x7136;&#x540E;&#x53CC;&#x65B9;&#x4F7F;&#x7528;&#x5BF9;&#x79F0;&#x6027;&#x52A0;&#x5BC6;&#x7B97;&#x6CD5;&#x4F20;&#x8F93;&#x6570;&#x636E;&#x3002;</p>
<p>&#x9700;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x662F;&#xFF0C;&#x7C7B;&#x4F3C; Diffie-Hellman &#x7B97;&#x6CD5;&#xFF0C;<strong>&#x975E;&#x5BF9;&#x79F0;&#x52A0;&#x5BC6;&#x7B97;&#x6CD5;&#x4E5F;&#x65E0;&#x6CD5;&#x786E;&#x5B9A;&#x901A;&#x4FE1;&#x53CC;&#x65B9;&#x7684;&#x8EAB;&#x4EFD;&#xFF0C;&#x4F9D;&#x7136;&#x4F1A;&#x906D;&#x5230;&#x4E2D;&#x95F4;&#x4EBA;&#x653B;&#x51FB;</strong>&#x3002;&#x6BD4;&#x5982; Hack &#x62E6;&#x622A; Bob &#x53D1;&#x51FA;&#x7684;&#x516C;&#x94A5;&#xFF0C;&#x7136;&#x540E;&#x5192;&#x5145; Bob &#x7684;&#x8EAB;&#x4EFD;&#x7ED9; Alice &#x53D1;&#x9001;&#x81EA;&#x5DF1;&#x7684;&#x516C;&#x94A5;&#xFF0C;&#x90A3;&#x4E48;&#x4E0D;&#x77E5;&#x60C5;&#x7684; Alice &#x5C31;&#x4F1A;&#x628A;&#x79C1;&#x5BC6;&#x6570;&#x636E;&#x7528; Hack &#x7684;&#x516C;&#x94A5;&#x52A0;&#x5BC6;&#xFF0C;Hack &#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x79C1;&#x94A5;&#x89E3;&#x5BC6;&#x7A83;&#x53D6;&#x3002;</p>
<p>&#x90A3;&#x4E48;&#xFF0C;Diffie-Hellman &#x7B97;&#x6CD5;&#x548C; RSA &#x975E;&#x5BF9;&#x79F0;&#x52A0;&#x5BC6;&#x7B97;&#x6CD5;&#x90FD;&#x53EF;&#x4EE5;&#x4E00;&#x5B9A;&#x7A0B;&#x5EA6;&#x4E0A;&#x89E3;&#x51B3;&#x5BC6;&#x94A5;&#x914D;&#x9001;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x4E5F;&#x5177;&#x6709;&#x76F8;&#x540C;&#x7684;&#x7F3A;&#x9677;&#xFF0C;&#x4E8C;&#x8005;&#x7684;&#x5E94;&#x7528;&#x573A;&#x666F;&#x6709;&#x4EC0;&#x4E48;&#x533A;&#x522B;&#x5462;&#xFF1F;</p>
<p>&#x7B80;&#x5355;&#x6765;&#x8BF4;&#xFF0C;&#x6839;&#x636E;&#x4E24;&#x79CD;&#x7B97;&#x6CD5;&#x7684;&#x57FA;&#x672C;&#x539F;&#x7406;&#x5C31;&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#x6765;&#xFF1A;</p>
<p>&#x5982;&#x679C;&#x53CC;&#x65B9;&#x6709;&#x4E00;&#x4E2A;&#x5BF9;&#x79F0;&#x52A0;&#x5BC6;&#x65B9;&#x6848;&#xFF0C;&#x5E0C;&#x671B;&#x52A0;&#x5BC6;&#x901A;&#x4FE1;&#xFF0C;&#x800C;&#x4E14;&#x4E0D;&#x80FD;&#x8BA9;&#x522B;&#x4EBA;&#x5F97;&#x5230;&#x94A5;&#x5319;&#xFF0C;&#x90A3;&#x4E48;&#x53EF;&#x4EE5;&#x4F7F;&#x7528; Diffie-Hellman &#x7B97;&#x6CD5;&#x4EA4;&#x6362;&#x5BC6;&#x94A5;&#x3002;</p>
<p>&#x5982;&#x679C;&#x4F60;&#x5E0C;&#x671B;&#x4EFB;&#x4F55;&#x4EBA;&#x90FD;&#x53EF;&#x4EE5;&#x5BF9;&#x4FE1;&#x606F;&#x52A0;&#x5BC6;&#xFF0C;&#x800C;&#x53EA;&#x6709;&#x4F60;&#x80FD;&#x591F;&#x89E3;&#x5BC6;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x4F7F;&#x7528; RSA &#x975E;&#x5BF9;&#x79F0;&#x52A0;&#x5BC6;&#x7B97;&#x6CD5;&#xFF0C;&#x516C;&#x5E03;&#x516C;&#x94A5;&#x3002;</p>
<p>&#x4E0B;&#x9762;&#xFF0C;&#x6211;&#x4EEC;&#x5C1D;&#x8BD5;&#x7740;&#x89E3;&#x51B3;&#x8BA4;&#x8BC1;&#x53D1;&#x9001;&#x65B9;&#x8EAB;&#x4EFD;&#x7684;&#x95EE;&#x9898;&#x3002;</p>
<h2 id="&#x56DB;&#x3001;&#x6570;&#x5B57;&#x7B7E;&#x540D;">&#x56DB;&#x3001;&#x6570;&#x5B57;&#x7B7E;&#x540D;</h2>
<p>&#x521A;&#x624D;&#x8BF4;&#x975E;&#x5BF9;&#x79F0;&#x52A0;&#x5BC6;&#xFF0C;&#x628A;&#x516C;&#x94A5;&#x516C;&#x5F00;&#x7528;&#x4E8E;&#x4ED6;&#x4EBA;&#x5BF9;&#x6570;&#x636E;&#x52A0;&#x5BC6;&#x7136;&#x540E;&#x53D1;&#x7ED9;&#x4F60;&#xFF0C;&#x53EA;&#x6709;&#x7528;&#x4F60;&#x624B;&#x4E0A;&#x5BF9;&#x5E94;&#x7684;&#x79C1;&#x94A5;&#x624D;&#x80FD;&#x5C06;&#x5BC6;&#x6587;&#x89E3;&#x5BC6;&#x3002;&#x5176;&#x5B9E;&#xFF0C;<strong>&#x79C1;&#x94A5;&#x4E5F;&#x53EF;&#x7528;&#x7528;&#x6765;&#x52A0;&#x5BC6;&#x6570;&#x636E;&#x7684;&#xFF0C;&#x5BF9;&#x4E8E; RSA &#x7B97;&#x6CD5;&#xFF0C;&#x79C1;&#x94A5;&#x52A0;&#x5BC6;&#x7684;&#x6570;&#x636E;&#x53EA;&#x6709;&#x516C;&#x94A5;&#x624D;&#x80FD;&#x89E3;&#x5F00;</strong>&#x3002;</p>
<p>&#x6570;&#x5B57;&#x7B7E;&#x540D;&#x4E5F;&#x662F;&#x5229;&#x7528;&#x4E86;&#x975E;&#x5BF9;&#x79F0;&#x6027;&#x5BC6;&#x94A5;&#x7684;&#x7279;&#x6027;&#xFF0C;&#x4F46;&#x662F;&#x548C;&#x516C;&#x94A5;&#x52A0;&#x5BC6;&#x5B8C;&#x5168;&#x98A0;&#x5012;&#x8FC7;&#x6765;&#xFF1A;<strong>&#x4ECD;&#x7136;&#x516C;&#x5E03;&#x516C;&#x94A5;&#xFF0C;&#x4F46;&#x662F;&#x7528;&#x4F60;&#x7684;&#x79C1;&#x94A5;&#x52A0;&#x5BC6;&#x6570;&#x636E;&#xFF0C;&#x7136;&#x540E;&#x628A;&#x52A0;&#x5BC6;&#x7684;&#x6570;&#x636E;&#x516C;&#x5E03;&#x51FA;&#x53BB;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x6570;&#x5B57;&#x7B7E;&#x540D;</strong>&#x3002;</p>
<p>&#x4F60;&#x53EF;&#x80FD;&#x95EE;&#xFF0C;&#x8FD9;&#x6709;&#x4EC0;&#x4E48;&#x7528;&#xFF0C;&#x516C;&#x94A5;&#x53EF;&#x4EE5;&#x89E3;&#x5F00;&#x79C1;&#x94A5;&#x52A0;&#x5BC6;&#xFF0C;&#x6211;&#x8FD8;&#x52A0;&#x5BC6;&#x53D1;&#x51FA;&#x53BB;&#xFF0C;&#x4E0D;&#x662F;&#x591A;&#x6B64;&#x4E00;&#x4E3E;&#x5417;&#xFF1F;</p>
<p>&#x662F;&#x7684;&#xFF0C;&#x4F46;&#x662F;<strong>&#x6570;&#x5B57;&#x7B7E;&#x540D;&#x7684;&#x4F5C;&#x7528;&#x672C;&#x6765;&#x5C31;&#x4E0D;&#x662F;&#x4FDD;&#x8BC1;&#x6570;&#x636E;&#x7684;&#x673A;&#x5BC6;&#x6027;&#xFF0C;&#x800C;&#x662F;&#x8BC1;&#x660E;&#x4F60;&#x7684;&#x8EAB;&#x4EFD;</strong>&#xFF0C;&#x8BC1;&#x660E;&#x8FD9;&#x4E9B;&#x6570;&#x636E;&#x786E;&#x5B9E;&#x662F;&#x7531;&#x4F60;&#x672C;&#x4EBA;&#x53D1;&#x51FA;&#x7684;&#x3002;</p>
<p>&#x4F60;&#x60F3;&#x60F3;&#xFF0C;&#x4F60;&#x7684;&#x79C1;&#x94A5;&#x52A0;&#x5BC6;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x53EA;&#x6709;&#x4F60;&#x7684;&#x516C;&#x94A5;&#x624D;&#x80FD;&#x89E3;&#x5F00;&#xFF0C;&#x90A3;&#x4E48;&#x5982;&#x679C;&#x4E00;&#x4EFD;&#x52A0;&#x5BC6;&#x6570;&#x636E;&#x80FD;&#x591F;&#x88AB;&#x4F60;&#x7684;&#x516C;&#x94A5;&#x89E3;&#x5F00;&#xFF0C;&#x4E0D;&#x5C31;&#x8BF4;&#x660E;&#x8FD9;&#x4EFD;&#x6570;&#x636E;&#x662F;&#x4F60;&#xFF08;&#x79C1;&#x94A5;&#x6301;&#x6709;&#x8005;&#xFF09;&#x672C;&#x4EBA;&#x53D1;&#x5E03;&#x7684;&#x5417;&#xFF1F;</p>
<p>&#x5F53;&#x7136;&#xFF0C;&#x52A0;&#x5BC6;&#x6570;&#x636E;&#x4EC5;&#x4EC5;&#x662F;&#x4E00;&#x4E2A;&#x7B7E;&#x540D;&#xFF0C;&#x7B7E;&#x540D;&#x5E94;&#x8BE5;&#x548C;&#x6570;&#x636E;&#x4E00;&#x540C;&#x53D1;&#x51FA;&#xFF0C;&#x5177;&#x4F53;&#x6D41;&#x7A0B;&#x5E94;&#x8BE5;&#x662F;&#xFF1A;</p>
<p>1&#x3001;Bob &#x751F;&#x6210;&#x516C;&#x94A5;&#x548C;&#x79C1;&#x94A5;&#xFF0C;&#x7136;&#x540E;&#x628A;&#x516C;&#x94A5;&#x516C;&#x5E03;&#x51FA;&#x53BB;&#xFF0C;&#x79C1;&#x94A5;&#x81EA;&#x5DF1;&#x4FDD;&#x7559;&#x3002;</p>
<p>2&#x3001;<strong>&#x7528;&#x79C1;&#x94A5;&#x52A0;&#x5BC6;&#x6570;&#x636E;&#x4F5C;&#x4E3A;&#x7B7E;&#x540D;&#xFF0C;&#x7136;&#x540E;&#x5C06;&#x6570;&#x636E;&#x9644;&#x5E26;&#x7740;&#x7B7E;&#x540D;&#x4E00;&#x540C;&#x53D1;&#x5E03;&#x51FA;&#x53BB;</strong>&#x3002;</p>
<p>3&#x3001;Alice &#x6536;&#x5230;&#x6570;&#x636E;&#x548C;&#x7B7E;&#x540D;&#xFF0C;&#x9700;&#x8981;&#x68C0;&#x67E5;&#x6B64;&#x4EFD;&#x6570;&#x636E;&#x662F;&#x5426;&#x662F; Bob &#x6240;&#x53D1;&#x51FA;&#xFF0C;&#x4E8E;&#x662F;&#x7528; Bob &#x4E4B;&#x524D;&#x53D1;&#x51FA;&#x7684;&#x516C;&#x94A5;&#x5C1D;&#x8BD5;&#x89E3;&#x5BC6;&#x7B7E;&#x540D;&#xFF0C;&#x5C06;&#x6536;&#x5230;&#x7684;&#x6570;&#x636E;&#x548C;&#x7B7E;&#x540D;&#x89E3;&#x5BC6;&#x540E;&#x7684;&#x7ED3;&#x679C;&#x4F5C;&#x5BF9;&#x6BD4;&#xFF0C;&#x5982;&#x679C;&#x5B8C;&#x5168;&#x76F8;&#x540C;&#xFF0C;&#x8BF4;&#x660E;&#x6570;&#x636E;&#x6CA1;&#x88AB;&#x7BE1;&#x6539;&#xFF0C;&#x4E14;&#x786E;&#x5B9E;&#x7531; Bob &#x53D1;&#x51FA;&#x3002;</p>
<p>&#x4E3A;&#x4EC0;&#x4E48; Alice &#x8FD9;&#x4E48;&#x80AF;&#x5B9A;&#x5462;&#xFF0C;&#x6BD5;&#x7ADF;&#x6570;&#x636E;&#x548C;&#x7B7E;&#x540D;&#x662F;&#x4E24;&#x90E8;&#x5206;&#xFF0C;&#x90FD;&#x53EF;&#x4EE5;&#x88AB;&#x6389;&#x5305;&#x5440;&#xFF1F;&#x539F;&#x56E0;&#x5982;&#x4E0B;&#xFF1A;</p>
<p>1&#x3001;&#x5982;&#x679C;&#x6709;&#x4EBA;&#x4FEE;&#x6539;&#x4E86;&#x6570;&#x636E;&#xFF0C;&#x90A3;&#x4E48; Alice &#x89E3;&#x5BC6;&#x7B7E;&#x540D;&#x4E4B;&#x540E;&#xFF0C;&#x5BF9;&#x6BD4;&#x53D1;&#x73B0;&#x4E8C;&#x8005;&#x4E0D;&#x4E00;&#x81F4;&#xFF0C;&#x5BDF;&#x89C9;&#x51FA;&#x5F02;&#x5E38;&#x3002;</p>
<p>2&#x3001;&#x5982;&#x679C;&#x6709;&#x4EBA;&#x66FF;&#x6362;&#x4E86;&#x7B7E;&#x540D;&#xFF0C;&#x90A3;&#x4E48; Alice &#x7528; Bob &#x7684;&#x516C;&#x94A5;&#x53EA;&#x80FD;&#x89E3;&#x51FA;&#x4E00;&#x4E32;&#x4E71;&#x7801;&#xFF0C;&#x663E;&#x7136;&#x548C;&#x6570;&#x636E;&#x4E0D;&#x4E00;&#x81F4;&#x3002;</p>
<p>3&#x3001;&#x4E5F;&#x8BB8;&#x6709;&#x4EBA;&#x4F01;&#x56FE;&#x4FEE;&#x6539;&#x6570;&#x636E;&#xFF0C;&#x7136;&#x540E;&#x5C06;&#x4FEE;&#x6539;&#x4E4B;&#x540E;&#x7684;&#x6570;&#x636E;&#x5236;&#x6210;&#x7B7E;&#x540D;&#xFF0C;&#x4F7F;&#x5F97; Alice &#x7684;&#x5BF9;&#x6BD4;&#x65E0;&#x6CD5;&#x53D1;&#x73B0;&#x4E0D;&#x4E00;&#x81F4;&#xFF1B;&#x4F46;&#x662F;&#x4E00;&#x65E6;&#x89E3;&#x5F00;&#x7B7E;&#x540D;&#xFF0C;&#x5C31;&#x4E0D;&#x53EF;&#x80FD;&#x518D;&#x91CD;&#x65B0;&#x751F;&#x6210; Bob &#x7684;&#x7B7E;&#x540D;&#x4E86;&#xFF0C;&#x56E0;&#x4E3A;&#x6CA1;&#x6709; Bob &#x7684;&#x79C1;&#x94A5;&#x3002;</p>
<p>&#x7EFC;&#x4E0A;&#xFF0C;<strong>&#x6570;&#x5B57;&#x7B7E;&#x540D;&#x53EF;&#x4EE5;&#x4E00;&#x5B9A;&#x7A0B;&#x5EA6;&#x4E0A;&#x8BA4;&#x8BC1;&#x6570;&#x636E;&#x7684;&#x6765;&#x6E90;</strong>&#x3002;&#x4E4B;&#x6240;&#x4EE5;&#x8BF4;&#x662F;&#x4E00;&#x5B9A;&#x7A0B;&#x5EA6;&#x4E0A;&#xFF0C;&#x662F;&#x56E0;&#x4E3A;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x4F9D;&#x7136;&#x53EF;&#x80FD;&#x53D7;&#x5230;&#x4E2D;&#x95F4;&#x4EBA;&#x653B;&#x51FB;&#x3002;&#x4E00;&#x65E6;&#x6D89;&#x53CA;&#x516C;&#x94A5;&#x7684;&#x53D1;&#x5E03;&#xFF0C;&#x63A5;&#x6536;&#x65B9;&#x5C31;&#x53EF;&#x80FD;&#x6536;&#x5230;&#x4E2D;&#x95F4;&#x4EBA;&#x7684;&#x5047;&#x516C;&#x94A5;&#xFF0C;&#x8FDB;&#x884C;&#x9519;&#x8BEF;&#x7684;&#x8BA4;&#x8BC1;&#xFF0C;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x59CB;&#x7EC8;&#x907F;&#x514D;&#x4E0D;&#x4E86;&#x3002;</p>
<p>&#x8BF4;&#x6765;&#x53EF;&#x7B11;&#xFF0C;&#x6570;&#x5B57;&#x7B7E;&#x540D;&#x5C31;&#x662F;&#x9A8C;&#x8BC1;&#x5BF9;&#x65B9;&#x8EAB;&#x4EFD;&#x7684;&#x4E00;&#x79CD;&#x65B9;&#x5F0F;&#xFF0C;&#x4F46;&#x662F;&#x524D;&#x63D0;&#x662F;&#x5BF9;&#x65B9;&#x7684;&#x8EAB;&#x4EFD;&#x5FC5;&#x987B;&#x662F;&#x771F;&#x7684;... &#x8FD9;&#x4F3C;&#x4E4E;&#x9677;&#x5165;&#x4E00;&#x4E2A;&#x5148;&#x6709;&#x9E21;&#x8FD8;&#x662F;&#x5148;&#x6709;&#x86CB;&#x7684;&#x6B7B;&#x5FAA;&#x73AF;&#xFF0C;<strong>&#x8981;&#x60F3;&#x786E;&#x5B9A;&#x5BF9;&#x65B9;&#x7684;&#x8EAB;&#x4EFD;&#xFF0C;&#x5FC5;&#x987B;&#x6709;&#x4E00;&#x4E2A;&#x4FE1;&#x4EFB;&#x7684;&#x6E90;&#x5934;&#xFF0C;&#x5426;&#x5219;&#x7684;&#x8BDD;&#xFF0C;&#x518D;&#x591A;&#x7684;&#x6D41;&#x7A0B;&#x4E5F;&#x53EA;&#x662F;&#x5728;&#x8F6C;&#x79FB;&#x95EE;&#x9898;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x771F;&#x6B63;&#x89E3;&#x51B3;&#x95EE;&#x9898;</strong>&#x3002;</p>
<h2 id="&#x4E94;&#x3001;&#x516C;&#x94A5;&#x8BC1;&#x4E66;">&#x4E94;&#x3001;&#x516C;&#x94A5;&#x8BC1;&#x4E66;</h2>
<p><strong>&#x8BC1;&#x4E66;&#x5176;&#x5B9E;&#x5C31;&#x662F;&#x516C;&#x94A5; + &#x7B7E;&#x540D;&#xFF0C;&#x7531;&#x7B2C;&#x4E09;&#x65B9;&#x8BA4;&#x8BC1;&#x673A;&#x6784;&#x9881;&#x53D1;</strong>&#x3002;&#x5F15;&#x5165;&#x53EF;&#x4FE1;&#x4EFB;&#x7684;&#x7B2C;&#x4E09;&#x65B9;&#xFF0C;&#x662F;&#x7EC8;&#x7ED3;&#x4FE1;&#x4EFB;&#x5FAA;&#x73AF;&#x7684;&#x4E00;&#x79CD;&#x53EF;&#x884C;&#x65B9;&#x6848;&#x3002;</p>
<p>&#x8BC1;&#x4E66;&#x8BA4;&#x8BC1;&#x7684;&#x6D41;&#x7A0B;&#x5927;&#x81F4;&#x5982;&#x4E0B;&#xFF1A;</p>
<p>1&#x3001;Bob &#x53BB;&#x53EF;&#x4FE1;&#x4EFB;&#x7684;&#x8BA4;&#x8BC1;&#x673A;&#x6784;&#x8BC1;&#x5B9E;&#x672C;&#x4EBA;&#x771F;&#x5B9E;&#x8EAB;&#x4EFD;&#xFF0C;&#x5E76;&#x63D0;&#x4F9B;&#x81EA;&#x5DF1;&#x7684;&#x516C;&#x94A5;&#x3002;</p>
<p>2&#x3001;Alice &#x60F3;&#x8DDF; Bob &#x901A;&#x4FE1;&#xFF0C;&#x9996;&#x5148;&#x5411;&#x8BA4;&#x8BC1;&#x673A;&#x6784;&#x8BF7;&#x6C42; Bob &#x7684;&#x516C;&#x94A5;&#xFF0C;&#x8BA4;&#x8BC1;&#x673A;&#x6784;&#x4F1A;&#x628A;&#x4E00;&#x5F20;&#x8BC1;&#x4E66;&#xFF08;Bob &#x7684;&#x516C;&#x94A5;&#x4EE5;&#x53CA;&#x81EA;&#x5DF1;&#x5BF9;&#x5176;&#x516C;&#x94A5;&#x7684;&#x7B7E;&#x540D;&#xFF09;&#x53D1;&#x9001;&#x7ED9; Alice&#x3002;</p>
<p>3&#x3001;Alice &#x68C0;&#x67E5;&#x7B7E;&#x540D;&#xFF0C;&#x786E;&#x5B9A;&#x8BE5;&#x516C;&#x94A5;&#x786E;&#x5B9E;&#x7531;&#x8FD9;&#x5BB6;&#x8BA4;&#x8BC1;&#x673A;&#x6784;&#x53D1;&#x9001;&#xFF0C;&#x4E2D;&#x9014;&#x672A;&#x88AB;&#x7BE1;&#x6539;&#x3002;</p>
<p>4&#x3001;Alice &#x901A;&#x8FC7;&#x8FD9;&#x4E2A;&#x516C;&#x94A5;&#x52A0;&#x5BC6;&#x6570;&#x636E;&#xFF0C;&#x5F00;&#x59CB;&#x548C; Bob &#x901A;&#x4FE1;&#x3002;</p>
<p><a href="../img/&#x6458;&#x6284;/labuladong/&#x52A0;&#x5BC6;&#x7B97;&#x6CD5;&#x7684;&#x524D;&#x8EAB;&#x4ECA;&#x4E16;/7.jpg" data-lightbox="462b124e-07c5-4fb8-aef2-a2c44f4a64d0" data-title="img"><img src="../img/&#x6458;&#x6284;/labuladong/&#x52A0;&#x5BC6;&#x7B97;&#x6CD5;&#x7684;&#x524D;&#x8EAB;&#x4ECA;&#x4E16;/7.jpg" alt="img"></a></p>
<blockquote>
<p>&#x6CE8;</p>
<p>&#x4EE5;&#x4E0A;&#x53EA;&#x662F;&#x4E3A;&#x4E86;&#x8BF4;&#x660E;&#xFF0C;&#x8BC1;&#x4E66;&#x53EA;&#x9700;&#x8981;&#x5B89;&#x88C5;&#x4E00;&#x6B21;&#xFF0C;&#x5E76;&#x4E0D;&#x9700;&#x8981;&#x6BCF;&#x6B21;&#x90FD;&#x5411;&#x8BA4;&#x8BC1;&#x673A;&#x6784;&#x8BF7;&#x6C42;&#xFF1B;&#x4E00;&#x822C;&#x662F;&#x670D;&#x52A1;&#x5668;&#x76F4;&#x63A5;&#x7ED9;&#x5BA2;&#x6237;&#x7AEF;&#x53D1;&#x9001;&#x8BC1;&#x4E66;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x8BA4;&#x8BC1;&#x673A;&#x6784;&#x3002;</p>
</blockquote>
<p>&#x4E5F;&#x8BB8;&#x6709;&#x4EBA;&#x95EE;&#xFF0C;Alice &#x8981;&#x60F3;&#x901A;&#x8FC7;&#x6570;&#x5B57;&#x7B7E;&#x540D;&#x786E;&#x5B9A;&#x8BC1;&#x4E66;&#x7684;&#x6709;&#x6548;&#x6027;&#xFF0C;&#x524D;&#x63D0;&#x662F;&#x8981;&#x6709;&#x8BE5;&#x673A;&#x6784;&#x7684;&#xFF08;&#x8BA4;&#x8BC1;&#xFF09;&#x516C;&#x94A5;&#xFF0C;&#x8FD9;&#x4E0D;&#x662F;&#x53C8;&#x56DE;&#x5230;&#x521A;&#x624D;&#x7684;&#x6B7B;&#x5FAA;&#x73AF;&#x4E86;&#x5417;&#xFF1F;</p>
<p>&#x6211;&#x4EEC;&#x5B89;&#x88C5;&#x7684;&#x6B63;&#x89C4;&#x6D4F;&#x89C8;&#x5668;&#x4E2D;&#x90FD;&#x9884;&#x5B58;&#x4E86;&#x6B63;&#x89C4;&#x8BA4;&#x8BC1;&#x673A;&#x6784;&#x7684;&#x8BC1;&#x4E66;&#xFF08;&#x5305;&#x542B;&#x5176;&#x516C;&#x94A5;&#xFF09;&#xFF0C;&#x7528;&#x4E8E;&#x786E;&#x8BA4;&#x673A;&#x6784;&#x8EAB;&#x4EFD;&#xFF0C;&#x6240;&#x4EE5;&#x8BF4;&#x8BC1;&#x4E66;&#x7684;&#x8BA4;&#x8BC1;&#x662F;&#x53EF;&#x4FE1;&#x7684;&#x3002;</p>
<p>Bob &#x5411;&#x673A;&#x6784;&#x63D0;&#x4F9B;&#x516C;&#x94A5;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x9700;&#x8981;&#x63D0;&#x4F9B;&#x5F88;&#x591A;&#x4E2A;&#x4EBA;&#x4FE1;&#x606F;&#x8FDB;&#x884C;&#x8EAB;&#x4EFD;&#x9A8C;&#x8BC1;&#xFF0C;&#x6BD4;&#x8F83;&#x4E25;&#x683C;&#xFF0C;&#x6240;&#x4EE5;&#x8BF4;&#x4E5F;&#x7B97;&#x662F;&#x53EF;&#x9760;&#x7684;&#x3002;</p>
<p>&#x83B7;&#x5F97;&#x4E86; Bob &#x7684;&#x53EF;&#x4FE1;&#x516C;&#x94A5;&#xFF0C;Alice &#x548C; Bob &#x4E4B;&#x95F4;&#x7684;&#x901A;&#x4FE1;&#x57FA;&#x4E8E;&#x52A0;&#x5BC6;&#x7B97;&#x6CD5;&#x7684;&#x4FDD;&#x62A4;&#xFF0C;&#x662F;&#x5B8C;&#x5168;&#x65E0;&#x61C8;&#x53EF;&#x51FB;&#x7684;&#x3002;</p>
<p>&#x73B0;&#x5728;&#x7684;&#x6B63;&#x89C4;&#x7F51;&#x7AD9;&#xFF0C;&#x5927;&#x90FD;&#x4F7F;&#x7528; HTTPS &#x534F;&#x8BAE;&#xFF0C;&#x5C31;&#x662F;&#x5728; HTTP &#x534F;&#x8BAE;&#x548C; TCP &#x534F;&#x8BAE;&#x4E4B;&#x95F4;&#x52A0;&#x4E86;&#x4E00;&#x4E2A; SSL/TLS &#x5B89;&#x5168;&#x5C42;&#x3002;&#x5728;&#x4F60;&#x7684;&#x6D4F;&#x89C8;&#x5668;&#x548C;&#x7F51;&#x7AD9;&#x670D;&#x52A1;&#x5668;&#x5B8C;&#x6210; TCP &#x63E1;&#x624B;&#x540E;&#xFF0C;SSL &#x534F;&#x8BAE;&#x5C42;&#x4E5F;&#x4F1A;&#x8FDB;&#x884C; SSL &#x63E1;&#x624B;&#x4EA4;&#x6362;&#x5B89;&#x5168;&#x53C2;&#x6570;&#xFF0C;&#x5176;&#x4E2D;&#x5C31;&#x5305;&#x542B;&#x8BE5;&#x7F51;&#x7AD9;&#x7684;&#x8BC1;&#x4E66;&#xFF0C;&#x4EE5;&#x4FBF;&#x6D4F;&#x89C8;&#x5668;&#x9A8C;&#x8BC1;&#x7AD9;&#x70B9;&#x8EAB;&#x4EFD;&#x3002;SSL &#x5B89;&#x5168;&#x5C42;&#x9A8C;&#x8BC1;&#x5B8C;&#x6210;&#x4E4B;&#x540E;&#xFF0C;&#x4E0A;&#x5C42;&#x7684; HTTP &#x534F;&#x8BAE;&#x5185;&#x5BB9;&#x90FD;&#x4F1A;&#x88AB;&#x52A0;&#x5BC6;&#xFF0C;&#x4FDD;&#x8BC1;&#x6570;&#x636E;&#x7684;&#x5B89;&#x5168;&#x4F20;&#x8F93;&#x3002;</p>
<p>&#x8FD9;&#x6837;&#x4E00;&#x6765;&#xFF0C;&#x4F20;&#x7EDF;&#x7684;&#x4E2D;&#x95F4;&#x4EBA;&#x653B;&#x51FB;&#x5C31;&#x51E0;&#x4E4E;&#x6CA1;&#x6709;&#x4E86;&#x751F;&#x5B58;&#x7A7A;&#x95F4;&#xFF0C;&#x653B;&#x51FB;&#x624B;&#x6BB5;&#x53EA;&#x80FD;&#x7531;&#x6280;&#x672F;&#x7F3A;&#x9677;&#x8F6C;&#x53D8;&#x4E3A;&#x5751;&#x8499;&#x62D0;&#x9A97;&#x3002;&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x8FD9;&#x79CD;&#x624B;&#x6BB5;&#x7684;&#x6548;&#x679C;&#x53CD;&#x800C;&#x66F4;&#x9AD8;&#x6548;&#xFF0C;&#x6BD4;&#x5982;&#x6211;&#x5C31;&#x53D1;&#x73B0;<strong>&#x7F51;&#x4E0A;&#x4E0D;&#x5C11;&#x4E0B;&#x8F7D;&#x7F51;&#x7AD9;&#x53D1;&#x5E03;&#x7684;&#x6D4F;&#x89C8;&#x5668;&#xFF0C;&#x4E0D;&#x4EC5;&#x5305;&#x542B;&#x4E71;&#x4E03;&#x516B;&#x7CDF;&#x7684;&#x5BFC;&#x822A;&#x548C;&#x6536;&#x85CF;&#x7F51;&#x5740;&#xFF0C;&#x8FD8;&#x5305;&#x542B;&#x4E00;&#x4E9B;&#x4E0D;&#x6B63;&#x89C4;&#x7684;&#x8BA4;&#x8BC1;&#x673A;&#x6784;&#x8BC1;&#x4E66;&#x3002;&#x4EFB;&#x4F55;&#x4EBA;&#x90FD;&#x53EF;&#x4EE5;&#x7533;&#x8BF7;&#x8BC1;&#x4E66;&#xFF0C;&#x8FD9;&#x4E9B;&#x4E0D;&#x6B63;&#x89C4;&#x8BC1;&#x4E66;&#x5F88;&#x53EF;&#x80FD;&#x9020;&#x6210;&#x5B89;&#x5168;&#x9690;&#x60A3;</strong>&#x3002;</p>
<h2 id="&#x516D;&#x3001;&#x6700;&#x540E;&#x603B;&#x7ED3;">&#x516D;&#x3001;&#x6700;&#x540E;&#x603B;&#x7ED3;</h2>
<p>&#x5BF9;&#x79F0;&#x6027;&#x52A0;&#x5BC6;&#x7B97;&#x6CD5;&#x4F7F;&#x7528;&#x540C;&#x4E00;&#x4E2A;&#x5BC6;&#x94A5;&#x52A0;&#x5BC6;&#x548C;&#x89E3;&#x5BC6;&#xFF0C;&#x96BE;&#x4EE5;&#x7834;&#x89E3;&#xFF0C;&#x52A0;&#x5BC6;&#x901F;&#x5EA6;&#x8F83;&#x5FEB;&#xFF0C;&#x4F46;&#x662F;&#x5B58;&#x5728;&#x5BC6;&#x94A5;&#x914D;&#x9001;&#x95EE;&#x9898;&#x3002;</p>
<p>Diffie-Hellman &#x5BC6;&#x94A5;&#x4EA4;&#x6362;&#x7B97;&#x6CD5;&#x53EF;&#x4EE5;&#x8BA9;&#x53CC;&#x65B9;&#x300C;&#x5FC3;&#x6709;&#x7075;&#x7280;&#x4E00;&#x70B9;&#x901A;&#x300D;&#xFF0C;&#x4E00;&#x5B9A;&#x7A0B;&#x5EA6;&#x89E3;&#x51B3;&#x5BC6;&#x94A5;&#x914D;&#x9001;&#x95EE;&#x9898;&#xFF0C;&#x4F46;&#x662F;&#x65E0;&#x6CD5;&#x9A8C;&#x8BC1;&#x901A;&#x4FE1;&#x65B9;&#x7684;&#x8EAB;&#x4EFD;&#xFF0C;&#x6240;&#x4EE5;&#x53EF;&#x80FD;&#x53D7;&#x5230;&#x4E2D;&#x95F4;&#x4EBA;&#x653B;&#x51FB;&#x3002;</p>
<p>&#x975E;&#x5BF9;&#x79F0;&#x6027;&#x52A0;&#x5BC6;&#x7B97;&#x6CD5;&#x751F;&#x6210;&#x4E00;&#x5BF9;&#x513F;&#x5BC6;&#x94A5;&#xFF0C;&#x628A;&#x52A0;&#x5BC6;&#x548C;&#x89E3;&#x5BC6;&#x7684;&#x5DE5;&#x4F5C;&#x5206;&#x5F00;&#x4E86;&#x3002;</p>
<p>RSA &#x7B97;&#x6CD5;&#x4F5C;&#x4E3A;&#x7ECF;&#x5178;&#x7684;&#x975E;&#x5BF9;&#x79F0;&#x52A0;&#x5BC6;&#x7B97;&#x6CD5;&#xFF0C;&#x6709;&#x4E24;&#x79CD;&#x7528;&#x9014;&#xFF1A;&#x5982;&#x679C;&#x7528;&#x4E8E;&#x52A0;&#x5BC6;&#xFF0C;&#x53EF;&#x4EE5;&#x628A;&#x516C;&#x94A5;&#x53D1;&#x5E03;&#x51FA;&#x53BB;&#x7528;&#x4E8E;&#x52A0;&#x5BC6;&#xFF0C;&#x53EA;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x79C1;&#x94A5;&#x53EF;&#x4EE5;&#x89E3;&#x5BC6;&#xFF0C;&#x4FDD;&#x8BC1;&#x4E86;&#x6570;&#x636E;&#x7684;&#x673A;&#x5BC6;&#x6027;&#xFF1B;&#x5982;&#x679C;&#x7528;&#x4E8E;&#x6570;&#x5B57;&#x7B7E;&#x540D;&#xFF0C;&#x628A;&#x516C;&#x94A5;&#x53D1;&#x5E03;&#x51FA;&#x53BB;&#x540E;&#xFF0C;&#x7528;&#x79C1;&#x94A5;&#x52A0;&#x5BC6;&#x6570;&#x636E;&#x4F5C;&#x4E3A;&#x7B7E;&#x540D;&#xFF0C;&#x4EE5;&#x8BC1;&#x660E;&#x8BE5;&#x6570;&#x636E;&#x7531;&#x79C1;&#x94A5;&#x6301;&#x6709;&#x8005;&#x6240;&#x53D1;&#x9001;&#x3002;&#x4F46;&#x662F;&#x65E0;&#x8BBA;&#x90A3;&#x79CD;&#x7528;&#x6CD5;&#xFF0C;&#x6D89;&#x53CA;&#x516C;&#x94A5;&#x7684;&#x53D1;&#x5E03;&#xFF0C;&#x90FD;&#x65E0;&#x6CD5;&#x907F;&#x514D;&#x4E2D;&#x95F4;&#x4EBA;&#x653B;&#x51FB;&#x3002;</p>
<p>&#x516C;&#x94A5;&#x8BC1;&#x4E66;&#x5C31;&#x662F;&#x516C;&#x94A5; + &#x7B7E;&#x540D;&#xFF0C;&#x7531;&#x53EF;&#x4FE1;&#x4EFB;&#x7684;&#x7B2C;&#x4E09;&#x65B9;&#x8BA4;&#x8BC1;&#x673A;&#x6784;&#x9881;&#x53D1;&#x3002;&#x7531;&#x4E8E;&#x6B63;&#x89C4;&#x6D4F;&#x89C8;&#x5668;&#x90FD;&#x9884;&#x88C5;&#x4E86;&#x53EF;&#x4FE1;&#x7684;&#x8BA4;&#x8BC1;&#x673A;&#x6784;&#x7684;&#x516C;&#x94A5;&#xFF0C;&#x6240;&#x4EE5;&#x53EF;&#x4EE5;&#x6709;&#x6548;&#x9632;&#x6B62;&#x4E2D;&#x95F4;&#x4EBA;&#x653B;&#x51FB;&#x3002;</p>
<p>HTTPS &#x534F;&#x8BAE;&#x4E2D;&#x7684; SSL/TLS &#x5B89;&#x5168;&#x5C42;&#x4F1A;&#x7EC4;&#x5408;&#x4F7F;&#x7528;&#x4EE5;&#x4E0A;&#x51E0;&#x79CD;&#x52A0;&#x5BC6;&#x65B9;&#x5F0F;&#xFF0C;<strong>&#x6240;&#x4EE5;&#x8BF4;&#x4E0D;&#x8981;&#x5B89;&#x88C5;&#x975E;&#x6B63;&#x89C4;&#x7684;&#x6D4F;&#x89C8;&#x5668;&#xFF0C;&#x4E0D;&#x8981;&#x4E71;&#x5B89;&#x88C5;&#x672A;&#x77E5;&#x6765;&#x6E90;&#x7684;&#x8BC1;&#x4E66;</strong>&#x3002;</p>
<p>&#x5BC6;&#x7801;&#x6280;&#x672F;&#x53EA;&#x662F;&#x5B89;&#x5168;&#x7684;&#x4E00;&#x5C0F;&#x90E8;&#x5206;&#xFF0C;&#x5373;&#x4FBF;&#x662F;&#x901A;&#x8FC7;&#x6B63;&#x89C4;&#x673A;&#x6784;&#x8BA4;&#x8BC1;&#x7684; HTTPS &#x7AD9;&#x70B9;&#xFF0C;&#x4E5F;&#x4E0D;&#x610F;&#x5473;&#x7740;&#x53EF;&#x4FE1;&#x4EFB;&#xFF0C;&#x53EA;&#x80FD;&#x8BF4;&#x660E;&#x5176;&#x6570;&#x636E;&#x4F20;&#x8F93;&#x662F;&#x5B89;&#x5168;&#x7684;&#x3002;&#x6280;&#x672F;&#x6C38;&#x8FDC;&#x4E0D;&#x53EF;&#x80FD;&#x771F;&#x6B63;&#x4FDD;&#x62A4;&#x4F60;&#xFF0C;&#x6700;&#x91CD;&#x8981;&#x7684;&#x8FD8;&#x662F;&#x5F97;&#x63D0;&#x9AD8;&#x4E2A;&#x4EBA;&#x7684;&#x5B89;&#x5168;&#x9632;&#x8303;&#x610F;&#x8BC6;&#xFF0C;&#x591A;&#x7559;&#x5FC3;&#x773C;&#x513F;&#xFF0C;&#x8C28;&#x614E;&#x5904;&#x7406;&#x654F;&#x611F;&#x6570;&#x636E;&#x3002; </p>
<p></p><footer class="page-footer"><span class="copyright">Copyright &#xA9; Ariescat all right reserved&#xFF0C;powered by Gitbook</span><span class="footer-modification">&#x6700;&#x540E;&#x4FEE;&#x6539;&#x65F6;&#x95F4;&#xFF1A;
2024-04-08 15:53
</span></footer><div id="gitalk-container"></div><link rel="stylesheet" href="https://unpkg.com/gitalk/dist/gitalk.css"><script src="https://cdn.bootcss.com/blueimp-md5/2.12.0/js/md5.min.js"></script><script src="https://unpkg.com/gitalk/dist/gitalk.min.js"></script><p></p>
 
          </section>
          
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>
 
        </div>
      </div>
      
    </div>

     
    <a
      href="../Note_Plus/资料收藏.html"
      class="navigation navigation-prev "
      aria-label="Previous page: 资料收藏"
    >
      <i class="fa fa-angle-left"></i>
    </a>
     
    <a
      href="鉴权接口.html"
      class="navigation navigation-next "
      aria-label="Next page: 鉴权接口"
    >
      <i class="fa fa-angle-right"></i>
    </a>
      
  </div>
  <script>
    function showModal() {
      document.getElementsByClassName("mask")[0].style.display = "block";
      document.getElementsByClassName("donate-modal")[0].style.display =
        "block";
    }
    // 切换赞赏码
    function showDonateImg(num) {
      let alipay = "";
      let wxpay = ""
      if(num){
        wxpay = "hidden"
      }else{
        alipay = "hidden"
      }
      document.getElementById("wxpay-code").hidden = wxpay;
      document.getElementById("alipay-code").hidden = alipay;
      document.getElementsByName("pay-way")[num].checked = "checked";
    }

    // 关闭赞赏框
    function closeDonateModal() {
      document.getElementsByClassName("mask")[0].style.display = "none";
      document.getElementsByClassName("donate-modal")[0].style.display = "none";
    }

    var gitbook = gitbook || [];
    gitbook.push(function () {
      gitbook.page.hasChanged({"page":{"title":"加密算法","level":"5.1","depth":1,"next":{"title":"鉴权接口","level":"5.2","depth":1,"path":"Note_Excerpt/鉴权接口.md","ref":"Note_Excerpt/鉴权接口.md","articles":[]},"previous":{"title":"资料收藏","level":"4.5","depth":1,"path":"Note_Plus/资料收藏.md","ref":"Note_Plus/资料收藏.md","articles":[]},"dir":"ltr"},"config":{"plugins":["theme-lou","-lunr","-search","-sharing","search-pro","code","lightbox","tbfed-pagefooter","expandable-chapters","gittalk","addcssjs"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"tbfed-pagefooter":{"copyright":"Copyright &copy Ariescat","modify_label":"最后修改时间：","modify_format":"YYYY-MM-DD HH:mm"},"search-pro":{},"addcssjs":{"css":["css/custom.css","css/auto-numbering.css"],"js":[]},"code":{"copyButtons":true},"theme-lou":{"hide-elements":[".summary .gitbook-link",".summary .divider",".copyright"],"color":"#FF4848","book-anchor-title":"本篇章节：","logo":"/img/logo.png","book-summary-title":"目录","search-placeholder":"在下想搜些啥呢......","imgStyle":{"isCenter":true,"isBox":false,"otherStyle":"max-width: 80%;"},"favicon":"/img/favicon.ico","appleTouchIconPrecomposed152":"/img/apple-touch-icon.png"},"fontsettings":{"theme":"white","family":"sans","size":2},"highlight":{},"lightbox":{"jquery":true,"sameUuid":false},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":true},"gittalk":{"clientID":"ac995666edfcde8e6079","clientSecret":"0e981d5d0c91bbb33cf33a356ea4962d137aafdc","repo":"blog-notes","owner":"Ariescat","admin":["Ariescat"],"id":"gittalk-comment"},"expandable-chapters":{}},"theme":"default","author":"Ariescat","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{"themeLou":{"nav":[{"target":"_blank","url":"https://home.ariescat.top/","name":"Home"},{"target":"_blank","url":"https://ariescat.top/","name":"Blog"},{"target":"_blank","url":"https://github.com/ariescat/","name":"Github"}]}},"title":"Ariescat's Note","gitbook":"*","description":"记录一些令人头秃的知识"},"file":{"path":"Note_Excerpt/加密算法.md","mtime":"2024-04-08T15:53:13.419Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2024-04-08T15:54:02.197Z"},"basePath":"..","book":{"language":""}});
    });
  </script>
</div>

        
    
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search-pro/jquery.mark.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search-pro/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-code/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lightbox/js/lightbox.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-expandable-chapters/expandable-chapters.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-gittalk/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-theme-lou/jweixin-1.6.0.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-theme-lou/lou.js"></script>
        
    

    

    </body>
</html>

